Autodesk.Revit.DB.View.SetElementOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets graphic overrides for an element in the view.
elementId:
Element to override.
overrideGraphicSettings:
An object representing all graphic overrides of the element in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetElementOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides for an element in the view.
elementId:
The element.
Returns:
An object representing all graphic overrides of the element elementId in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.IsFilterApplied(Autodesk.Revit.DB.ElementId)
Indicates if a filter is applied to the view.
filterElementId:
ElementId of the filter.
Returns:
True if the filter is applied to the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetIsFilterEnabled(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets the filter enabled flag.
Remarks:
Several filters can be applied to a view in a sertain order. This enable/disable flag
allows one to quickly turn on/off the action of a particular filter in this view (without
removing the filter from the set of applied filters and loosing the corresponding overrides).
By default, all the filters applied to a view are enabled.
filterElementId:
The ElementId of the filter.
enable:
True if the specified filter should be enabled in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.GetIsFilterEnabled(Autodesk.Revit.DB.ElementId)
Identifies if the filter is enabled in this view.
Remarks:
Several filters can be applied to a view in a certain order. This enable/disable flag
allows one to quickly turn on/off the action of a particular filter in this view (without
removing the filter from the set of applied filters and losing the corresponding overrides).
By default, all the filters applied to a view are enabled.
filterElementId:
The ElementId of the filter.
Returns:
True if the specified filter is enabled in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.SetFilterVisibility(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets the visibility of the elements associated with a filter.
Remarks:
If the filter is not currently applied to the view, this will add the filter with the specified visibility.
filterElementId:
The ElementId of the filter.
visibility:
True if the elements associated with the filter are visible in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetFilterVisibility(Autodesk.Revit.DB.ElementId)
Gets the visibility of the elements associated with a filter.
filterElementId:
The ElementId of the filter.
Returns:
True if the elements associated with the filter are visible in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.RemoveFilter(Autodesk.Revit.DB.ElementId)
Removes a filter from the view.
filterElementId:
ElementId of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.AddFilter(Autodesk.Revit.DB.ElementId)
Adds a filter to the view.
Remarks:
The filter will be added with default overrides, which means that there will be no change in the view's display.
The filter is appended as the last filter in the order of filters applied to this view.
filterElementId:
ElementId of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Filter is already applied to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetFilterOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets the overrides associated with a filter.
Remarks:
If the filter is not currently applied to the view, this will add the filter with the assigned overrides.
filterElementId:
ElementId of the filter.
overrideGraphicSettings:
The overrides to apply to the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetFilterOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides that a filter applies to the view.
filterElementId:
ElementId of the filter.
Returns:
Object representing all graphic overrides of the filter in the view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Filter is not applied to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014